In [98]:
import pandas as pd

In [99]:
#To add a new column

data = {
    'Name':['Karan','Meera','David','Anu'],
    'Age':[21,23,30,20],
    'City':['Banglore','Pune','Hyderabad','Kolkata']
    }
df = pd.DataFrame(data)

df['Marks'] = [95,76,55,82]

df

    Name  Age       City  Marks
0  Karan   21   Banglore     95
1  Meera   23       Pune     76
2  David   30  Hyderabad     55
3    Anu   20    Kolkata     82

In [100]:
#change the name in the 3rd row (index 2) to 'Sonu

df['Name'][2] = 'Sonu' 

df

C:\Users\Sinsinav505\AppData\Local\Temp\ipykernel_29172\1378947448.py:3: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Name'][2] = 'Sonu'
C:\Users\Sinsinav505\AppData\Local\Temp\ipykernel_29172\1378947448.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2] = 'Sonu'

    Name  Age       City  Marks
0  Karan   21   Banglore     95
1  Meera   23       Pune     76
2   Sonu   30  Hyderabad     55
3    Anu   20    Kolkata     82

In [101]:
#change the name in the 3rd row (index 2) to 'Sonu

df.loc[2,'Name'] = 'Sonu'

df

    Name  Age       City  Marks
0  Karan   21   Banglore     95
1  Meera   23       Pune     76
2   Sonu   30  Hyderabad     55
3    Anu   20    Kolkata     82

In [102]:
# ⿡ Series from List
# ------------------------------------------------------------
# Create a Pandas Series from the list [5, 10, 15, 20, 25]
# - Display the third element using both iloc and loc
# - Display all elements greater than 10


l = [5,10,15,20,25]
a = pd.Series(l,index=[10,11,12,13,14])
print(a.iloc[2])
print(a.loc[12])
print(a[a>10])

15
15
12    15
13    20
14    25
dtype: int64

In [103]:
# ⿢ DataFrame Creation
# ------------------------------------------------------------
# Create a DataFrame using:
# {
#   'Name': ['Riya', 'Amit', 'Sara', 'John'],
#   'Age': [22, 25, 24, 28],
#   'City': ['Delhi', 'Mumbai', 'Chennai', 'Delhi']
# }
# - Display only the columns Name and City
# - Display the first two rows only

d = {
    'Name': ['Riya', 'Amit', 'Sara', 'John'],
    'Age': [22, 25, 24, 28],
    'City': ['Delhi', 'Mumbai', 'Chennai', 'Delhi']
}
dd = pd.DataFrame(d)
print(dd[['Name','City']])

dd.head(2)

   Name     City
0  Riya    Delhi
1  Amit   Mumbai
2  Sara  Chennai
3  John    Delhi

   Name  Age    City
0  Riya   22   Delhi
1  Amit   25  Mumbai

In [104]:
# ⿣ Conditional Filtering
# ------------------------------------------------------------
# From the above DataFrame:
# - Display rows where Age > 23
# - Display rows where City == 'Delhi' and Age > 23

print(dd[dd['Age']>23])
dd[(dd['City'] == 'Delhi') & (dd['Age'] > 23)]

   Name  Age     City
1  Amit   25   Mumbai
2  Sara   24  Chennai
3  John   28    Delhi

   Name  Age   City
3  John   28  Delhi

In [105]:
# ⿤ Add and Modify Columns
# ------------------------------------------------------------
# Add a new column "Marks" = [85, 92, 78, 88]
# Change the Name in the 3rd row (index 2) to 'Rahul'

dd["Marks"] = [85,92,78,88]
dd
dd.loc[2,"Name"] = 'Rahul'
dd

    Name  Age     City  Marks
0   Riya   22    Delhi     85
1   Amit   25   Mumbai     92
2  Rahul   24  Chennai     78
3   John   28    Delhi     88

In [106]:
# ⿥ Drop / Rename Columns
# ------------------------------------------------------------
# Drop the column "City"
# Rename the column "Marks" to "Score"

print(dd.drop(columns='City'))
dd.rename(columns ={'Marks':'Score'},inplace=0)

    Name  Age  Marks
0   Riya   22     85
1   Amit   25     92
2  Rahul   24     78
3   John   28     88

    Name  Age     City  Score
0   Riya   22    Delhi     85
1   Amit   25   Mumbai     92
2  Rahul   24  Chennai     78
3   John   28    Delhi     88

In [107]:
# ⿦ Handling Missing Values
# ------------------------------------------------------------
# Create a DataFrame:
# {
#   'Name': ['Amit', 'Riya', 'Sara', None],
#   'Age': [25, None, 22, 30]
# }
# - Count the number of missing values per column
# - Replace missing values in 'Age' with the mean age

k = {
    'Name': ['Amit', 'Riya', 'Sara', None],
    'Age': [25, None, 22, 30]
}
kk = pd.DataFrame(k)
kk

   Name   Age
0  Amit  25.0
1  Riya   NaN
2  Sara  22.0
3  None  30.0

In [108]:
kk.dropna().value_counts()

Name  Age
Amit  25.0    1
Sara  22.0    1
Name: count, dtype: int64

In [ ]:
kk.fillna({"Age":kk['Age'].mean()},inplace=False)

   Name        Age
0  Amit  25.000000
1  Riya  25.666667
2  Sara  22.000000
3  None  30.000000

In [110]:
m = kk["Age"].mean()
print(m)

25.666666666666668

In [115]:

# ⿧ Sorting
# ------------------------------------------------------------
# Using this data:
# {
#   'Name': ['Riya', 'Amit', 'Sara', 'John'],
#   'Marks': [85, 92, 78, 88]
# }
# - Sort the DataFrame by Marks (ascending)
# - Then sort again by Marks (descending)


n = {
    'Name': ['Riya', 'Amit', 'Sara', 'John'],
    'Marks': [85, 92, 78, 88]
}
nn = pd.DataFrame(n)
nn.sort_values("Marks",ascending=False)

   Name  Marks
1  Amit     92
3  John     88
0  Riya     85
2  Sara     78

In [116]:
nn.sort_values("Marks",ascending=True)

   Name  Marks
2  Sara     78
0  Riya     85
3  John     88
1  Amit     92

In [119]:
# ⿨ Grouping & Aggregation
# ------------------------------------------------------------
# {
#   'City': ['Delhi', 'Delhi', 'Chennai', 'Mumbai', 'Mumbai'],
#   'Marks': [80, 90, 70, 85, 95]
# }
# - Find average Marks per City
# - Find maximum Marks per City


c = {
    'City': ['Delhi', 'Delhi', 'Chennai', 'Mumbai', 'Mumbai'],
    'Marks': [80, 90, 70, 85, 95]
}

cc = pd.DataFrame(c)
print(cc.groupby('City')['Marks'].mean())
cc.groupby('City')['Marks'].max()

City
Chennai    70.0
Delhi      85.0
Mumbai     90.0
Name: Marks, dtype: float64

City
Chennai    70
Delhi      90
Mumbai     95
Name: Marks, dtype: int64